data/sysbench/c2j-5/rndwr/150G/nvme0n1thread40
WARNING: --num-threads is deprecated, use --threads instead
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.11 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 40
Initializing random number generator from current time


Extra file open flags: 0
128 files, 1.1719GiB each
150GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Calling fsync() after each write operation.
Using synchronous I/O mode
Doing random write test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      0.00
    writes/s:                     89965.04
    fsyncs/s:                     89965.04

Throughput:
    read, MiB/s:                  0.00
    written, MiB/s:               1405.70

General statistics:
    total time:                          60.0004s
    total number of events:              5398245

Latency (ms):
         min:                                  0.03
         avg:                                  0.44
         max:                                 19.49
         95th percentile:                      1.04
         sum:                            2364735.96

Threads fairness:
    events (avg/stddev):           134956.1250/385.25
    execution time (avg/stddev):   59.1184/0.01